app/controllers/products_controller.rb

INSERT INTO "products" ("name", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Moca Coffee"], ["bio", "100 Bath"], ["created_at", "2018-03-02 07:43:24.769451"], ["updated_at", "2018-03-02 07:43:24.769451"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save